## Staging: load_balancer
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 2 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                    NAME                     |
|--------|---------------------------------------------|
| add    | `aws_lb.saas_procurement`                   |
|        | `aws_lb_listener.saas_procurement_listener` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_lb.saas_procurement will be created
  + resource "aws_lb" "saas_procurement" {
      + arn                                         = (known after apply)
      + arn_suffix                                  = (known after apply)
      + desync_mitigation_mode                      = "defensive"
      + dns_name                                    = (known after apply)
      + drop_invalid_header_fields                  = true
      + enable_deletion_protection                  = true
      + enable_http2                                = true
      + enable_tls_version_and_cipher_suite_headers = false
      + enable_waf_fail_open                        = false
      + enable_xff_client_port                      = false
      + id                                          = (known after apply)
      + idle_timeout                                = 60
      + internal                                    = false
      + ip_address_type                             = (known after apply)
      + load_balancer_type                          = "application"
      + name                                        = "saas-procurement-alb"
      + preserve_host_header                        = false
      + security_groups                             = [
          + "sg-09cf9f18b3a61b643",
        ]
      + subnets                                     = [
          + "subnet-01a482ab028dbb38a",
          + "subnet-0458b13f2b680703f",
          + "subnet-0d76fea2786c5d960",
        ]
      + tags                                        = {
          + "CostCentre" = "saas-procurement"
        }
      + tags_all                                    = {
          + "CostCentre" = "saas-procurement"
        }
      + vpc_id                                      = (known after apply)
      + xff_header_processing_mode                  = "append"
      + zone_id                                     = (known after apply)

      + subnet_mapping {
          + allocation_id        = (known after apply)
          + ipv6_address         = (known after apply)
          + outpost_id           = (known after apply)
          + private_ipv4_address = (known after apply)
          + subnet_id            = (known after apply)
        }
    }

  # aws_lb_listener.saas_procurement_listener will be created
  + resource "aws_lb_listener" "saas_procurement_listener" {
      + arn               = (known after apply)
      + certificate_arn   = "arn:aws:acm:ca-central-1:394954348146:certificate/2515ca66-51aa-407d-9a4d-6f86b86f27bb"
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 443
      + protocol          = "HTTPS"
      + ssl_policy        = "ELBSecurityPolicy-FS-1-2-Res-2020-10"
      + tags_all          = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = "arn:aws:elasticloadbalancing:ca-central-1:394954348146:targetgroup/saas-procurement/c0caf8eb8e958ee9"
          + type             = "forward"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.saas_procurement"]
WARN - plan.json - main - Missing Common Tags: ["aws_lb.saas_procurement"]
WARN - plan.json - main - Missing Common Tags: ["aws_lb_listener.saas_procurement_listener"]
WARN - plan.json - main - Missing Common Tags: ["aws_lb_target_group.saas_procurement"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.saas_procurement_load_balancer"]

22 tests, 17 passed, 5 warnings, 0 failures, 0 exceptions

```

</details>
